<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html lang="CA">
<HEAD><TITLE>M7.1 Procés de visualització 2D.Exercicis.</TITLE>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<LINK REL="stylesheet" type="text/css" HREF="../upc.css">
<script type="text/javascript" src="../upc.js"></script>
</HEAD>
<BODY >
<SCRIPT>
top.passara("vis2D","defs");
</SCRIPT>
<A NAME="inici"></a>
<DIV CLASS="nav">
<a href="Retallat.html">[Anterior]</a>
[Següent]
<A HREF="main71.html">[Tornar al començament de l'apartat]</a>
<A HREF="main74.html">[Següent apartat]</a>
</div>
<br><br>
<a class="tit1">Definicions</a><a class="tit2">.Exercicis</a>
<P>A continuaci&oacute; alguns exercicis que us perpetran avaluar si heu
assolit els conceptes b&agrave;sics d'aquest apartat. No obstant el millor
procediment es "jugar" amb els applets dels diferents apartats.
<p><b>1)</b> Despr&egrave;s de quines modificacions de la Finestra_2D
(zoom o pan) i/o Vista es pot deixar de verificar la&nbsp; relaci&oacute;
d'aspecte entre ambdues finestres.
<p><b>2)</b> Si l'escena a visualitzar es 3D, cal implementar i aplicar-l'hi
el proc&eacute;s de visualitzaci&oacute; 2D?
<p><b>3)</b> Modificar l'acci&oacute; RelacioAspecte per a que modifiqui
les mides de la Vista.
<p><b>4)</b> Es vol dibuixar una escena composta per una rudiment&agrave;ria
pantalla (com la de les figures d'exemple d'aquest m&ograve;dul) en la
qual s'est&agrave; visualitzant la mateixa escena (es a dir una pantalla)
. Indiqueu un algorisme de principi que permeti aconseguir la imatge dessitjada
utilitzant les accions d'especificaci&oacute; de la Finestra_2D, Vista
i una acci&oacute; VisualitzaEscena() que pinta tota la geometria de l'escena
(la pantalla) mitjan&ccedil;ant l'us de primitives gr&agrave;fiques.
<p><b>5)</b> Una aplicaci&oacute; gr&agrave;fica ha de simular l'animaci&oacute;
d'un cotxe en una escena 2D. L'escena cont&eacute; altres objectes a m&eacute;s
del cotxe. Escriu un algorisme de principi per aquesta aplicaci&oacute;:
utilitza les primitives gr&agrave;fiques introduides i les accions d'especificaci&oacute;
de la Finestra_2D i de la Vista. Recorda que cal definir sempre el Window
i el Viewport abans d'utilitzar qualsevol primitiva gr&agrave;fica i que
de la seva definici&oacute; en depen com quedar&agrave; la imatge en pantalla.
Pots simular la translaci&oacute; del cotxe modificant la Finestra_2D i
redibuixant el cotxe. Pots pensar que tens una acci&oacute; esborra_cotxe()
que esborra de pantalla el cotxe i una acci&oacute; pinta_cotxe().
<br><br><DIV CLASS="nav">
<a href="Retallat.html">[Anterior]</a>
[Següent]
<A HREF="main71.html">[Tornar al començament de l'apartat]</a>
<A HREF="main74.html">[Següent apartat]</a>
</div></BODY>
</HTML>
