<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML lang="CA">
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <TITLE>Introducci&oacute;</TITLE>
    <LINK REL="stylesheet" type="text/css" HREF="upc.css">
	<script type="text/javascript" src="upc.js"></script>
</HEAD>
<BODY onLoad='top.passara("intro", "");'>
<A NAME="inici"></A>
<BR><BR>

<div class=tit1>Introducci&oacute;</div>

<p>La inform&agrave;tica gr&agrave;fica &eacute;s tal vegada una de
les &agrave;rees de la nostra ci&egrave;ncia que resulta m&eacute;s
atractiva a amplis grups de membres de la professi&oacute;. Moltes de
les seves t&egrave;cniques han representat una lenta per&ograve;
constant i avasalladora revoluci&oacute;.  Avui treballar des d'un
terminal purament textual (el que tothom entenia per terminal fa sols
una decena d'anys) sembla primitiu, tosc. I el que separa a aquests
terminals dels entorns m&eacute;s moderns, amb finestres, icones
diversitat de tipus de lletres i interf&iacute;cies de
manipulaci&oacute; directa, s&oacute;n els gr&agrave;fics.&nbsp;

<P>Sigui quina sigui la ra&oacute; que fa aquests entorns m&eacute;s
atractius, el cert &eacute;s que una certa familiaritat amb nocions de
gr&agrave;fics es fa m&eacute;s i m&eacute;s necess&agrave;ria cara al
futur desenvolupament a la professi&oacute;. En bona mida per la
import&agrave;ncia de les interf&iacute;cies gr&agrave;fiques,
per&ograve; tamb&eacute; pel creixement dels &agrave;mbits en
qu&egrave; els gr&agrave;fics es fan servir. Si d'antuvi es van
introdu&iuml;r els gr&agrave;fics fonamentalment en aplicacions
t&egrave;cniques (fonamentalment de disseny, despla&ccedil;ant
gradualment l'&uacute;s de pl&agrave;nols en paper), progressivament i
a mida que el nostre coneixement aumentava i que aumentava
tamb&eacute; la pot&egrave;ncia gr&agrave;fica dels computadors
disponibles, els gr&agrave;fics s'han anat estenent a molt diversos
&agrave;mbits, com la imatge sint&egrave;tica (usada en publicitat,
animaci&oacute; i efectes especials per a pel&middot;l&iacute;cules),
les aplicacions m&egrave;diques o la visualitzaci&oacute; de
dades.&nbsp;

<P>A la nostra Universitat existeixen diverses assignatures a les
titul.lacions d'Inform&agrave;tica i d'Enginyeria Industrial en que
l'alumne pot introduir-se en l'aprenentatge dels conceptes fonamentals
relacionats amb la inform&agrave;tica gr&agrave;fica en dues i tres
dimensions, i en problemes relacionats amb el tractament, la
representaci&oacute; i l'entrada de dades gr&agrave;fiques.&nbsp;

<P>El material docent que presentem es considera complementari per
aquestes assignatures i es centra en aquells temes en que
l'experi&egrave;ncia docent ha demostrat que, tot i formar part&nbsp;
del nucli de coneixements de la inform&agrave;tica gr&agrave;fica,
s&oacute;n especialment dificultosos per l'alumnat i requereixen una
bona dosi de visi&oacute; tridimensional.  Concretament es
presenta:&nbsp; el proc&eacute;s de visualitzaci&oacute; 2D,&nbsp; el
proc&eacute;s de visualitzaci&oacute; 3D, la deteminaci&oacute; de
visibilitat, i la il.luminaci&oacute; i color.&nbsp;

<P>El llibre ha de permetre a l'estudiant: introduir-se en un tema
(assolir conceptes b&agrave;sics), aprofundir en ell (experimentant
amb les aplicacions interactives incorporades) i auto-avaluar-se
(resolent els execicis proposats).  Estem conven&ccedil;uts que la
utilitzaci&oacute; dels recursos multim&egrave;dia permetr&agrave;
simplificar la comprensi&oacute; de conceptes altrament
complexos.&nbsp;

<P>Una altra utilitat del material presentat pot ser com a recurs
complementari docent pel professorat. La portabilitat del llibre
permet la seva instal.lació en un PC portàtil i la realitzaci&oacute;
de demostracions interactives a l'aula.&nbsp;

<P>Esperem en un futur proper complementar el material amb la resta de
temes que completarien la doc&egrave;ncia d'una assignatura fonamental
de Grafics per Computador. Quedarien per incloure els temes de:
hardware gr&agrave;fic, interacci&oacute; home-m&agrave;quina,
modelatge d'escenes i matem&agrave;tica per gr&agrave;fics.&nbsp;
<BR>&nbsp;

<H2>
Agra&iuml;ments</H2>

<p>La preparaci&oacute; d'aquest llibre ha comportat, a m&eacute;s de
la seva concepci&oacute; i de la seva redacci&oacute;, un gran nombre
d'hores dedicades a la programaci&oacute; dels diversos applets que
ilustren alguns dels temes, la confecci&oacute; de figures, i el
<I>layout</I> i programaci&oacute; de les p&agrave;gines del curs
propiament&nbsp; dit. Per tot aix&ograve; els autors han comptat amb
la valuosa col&middot;laboraci&oacute; de Daniel Luque, Eloi Maduell,
Jordi Mart&iacute;n, Xavier Saez i David Ganyan. A tots ells volem fer
arribar el nostre m&eacute;s sincer agra&iuml;ment.&nbsp;

<P>Tamb&eacute; volem agra&iuml;r a Frederic P&eacute;rez i Eva
Moncl&uacute;s, autors de varies de les imatges incloses al text i que
reprodu&iuml;m aqu&iacute; amb el seu perm&iacute;s.&nbsp;

</BODY>
</HTML>
